package others;

public class review211004 {
    /*
    클래스란?? zB)설계도
    클래스로 구현한것 zB)빌딩, 아파트 등 설계도를 이용하여 만들어낸것
    클래스의 구성요소
    -멤버필드(변수, 상수)///명사
    -메소드(생성자)///동사

    *멤버필드 -> 생성자 -> 메소드 순으로 작성

    *생성자 (클래스에 생성자가 없으면 "기본생성자"((파라미터(매개변수)가 없는)를 자동으로 컴파일러가 넣어줌)
    -클래스명과 같다 (대문자로 시작)
    -리턴타입이 없어야한다

    *오버로딩 : 똑같은 이름의 메소드를 여러개 만들수 있는 기술
             -파라미터만 다르다면 다르게 만들수 있다
             -(변수명은 중요하지 않음)타입만 중요(타입의 종류,갯수,순서,리턴타입은 상관없음)


     *접근제한자(접근지시어)//간결화, 디버깅시 유용
     private : 클래스내에서만 사용가능
     default(아무것도 안적은것)
     protected : 상속과 관련, 부모의 필드,메소드를 자식까지에서만 사용가능(다른 패키지어도)
     public : 패키지 내에서 사용가능

     *static (정적메모리)
     -> 작성순간 데이터메모리에 입력되어 언제든지 사용가능(객체화,인스턴트화 필요 X)
     장려?
     -파라미터값만 이용할때(멤버필드를 사용안할때)
     -멤버필드를 사용하는데, 그 멤버필드가 static일때 사용
     */

    //java nord??? ->자바 스크립트에서 사용하는것인가?

    //배열로 카드덱을 만드려면 card에다 값을 어케집어넣지?
}
